/**
 * @Desc：
 * @Usage:
 * @Notify：
 * @Depend：
 *
 * Created by JuKun on 2017/6/10.
 */
$(function(){
    var container = {
        init:function(){
            console.log("646464");
            var _t =this,
                _data = {
                "links": [
                    {
                        "name": "420682198810192668",
                    },
                    {
                        "name": "152900199106198444",
                    },
                    {
                        "name": "450100197802166709",
                    },
                    {
                        "name": "610821197909088165",
                    },
                    {
                        "name": "210505199007210262",
                    },
                    {
                        "name": "141125198009151755",
                    },
                    {
                        "name": "231222198103150503",
                    },
                    {
                        "name": "41032219750625081X",
                    },
                    {
                        "name": "41032219750625081x",
                    },
                    {
                        "name": "130434198110197109",
                    },
                    {
                        "name": "610821197909088165",
                    },
                    {
                        "name": "210505199007210262",
                    },
                    {
                        "name": "340702199101013047",
                    },
                    {
                        "name": "511801199003080782",
                    },
                    {
                        "name": "411381198502053857",
                    },
                    {
                        "name": "310117199412165415",
                    },
                    {
                        "name": "540100197701141803",
                    },
                    {
                        "name": "650205199108136116",
                    },
                    {
                        "name": "142703199303112714",
                    }
                ]
            };
            var j=0;
            $.each(_data.links,function(i,val){
                if(!_t.checkIdCard(val.name)) {
                    j++;
                    console.log(j);
                    console.log(val.name);
                }
            })
        },
        checkIdCard:function(Obj){
                var city = {
                    11: "北京",
                    12: "天津",
                    13: "河北",
                    14: "山西",
                    15: "内蒙古",
                    21: "辽宁",
                    22: "吉林",
                    23: "黑龙江 ",
                    31: "上海",
                    32: "江苏",
                    33: "浙江",
                    34: "安徽",
                    35: "福建",
                    36: "江西",
                    37: "山东",
                    41: "河南",
                    42: "湖北 ",
                    43: "湖南",
                    44: "广东",
                    45: "广西",
                    46: "海南",
                    50: "重庆",
                    51: "四川",
                    52: "贵州",
                    53: "云南",
                    54: "西藏 ",
                    61: "陕西",
                    62: "甘肃",
                    63: "青海",
                    64: "宁夏",
                    65: "新疆",
                    71: "台湾",
                    81: "香港",
                    82: "澳门",
                    91: "国外 "
                };
                var tip = "",
                    pass = true,
                    Obj =Obj.toUpperCase();
            if (Obj.length == 15) {
                //15位身份证直接过
                pass = true;
            }else if (!Obj || !/^\d{6}(18|19|20)?\d{2}(0[1-9]|1[012])(0[1-9]|[12]\d|3[01])\d{3}(\d|X)$/i.test(Obj)){
                //tip = "身份证号格式错误";
                pass = false;
            } else if (!city[Obj.substr(0, 2)]) {
                //tip = "地址编码错误";
                pass = false;
            } else if (Obj.length == 18){
                //18位身份证需要验证最后一位校验位
                Obj = Obj.split('');
                //∑(ai×Wi)(mod 11)
                //加权因子
                var factor = [7, 9, 10, 5, 8, 4, 2, 1, 6, 3, 7, 9, 10, 5, 8, 4, 2],
                    parity = [1, 0, 'X', 9, 8, 7, 6, 5, 4, 3, 2],//校验位
                    sum = 0,
                    ai = 0,
                    wi = 0;
                for (var i = 0; i < 17; i++) {
                    ai = Obj[i];
                    wi = factor[i];
                    sum += ai * wi;
                }
                if (parity[sum % 11] != Obj[17]) {
                    //tip = "校验位错误";
                    pass = false;
                }
            }
            return pass;
        }
    };
    container.init();
});